app/Controllers/Auth.php

    public function authenticate()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();

        $user = $userModel
            ->where('username', $username)
            ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin01'
 LIMIT 1